using Newtonsoft.Json.Linq;
using System;
using System.Collections.Generic;
using System.Text;

namespace tech.msgp.groupmanager.Code.FunctionMods
{
    class SpecialDaysCelebration
    {
        private readonly string[] holiday ={
            "0101元旦",
            "0202世界湿地日",
            "0207国际声援南非日",
            "0210国际气象节",
            "0214情人节",
            "0301国际海豹日",
            "0303全国爱耳日",
            "0305学雷锋活动日",
            "0308国际妇女节",
            "0312植树节",
            "0314国际警察日",
            "0315消费者权益日",
            "0317中国国医节 国际航海日",
            "0321世界森林日 消除种族歧视国际日 世界儿歌日",
            "0322世界水日",
            "0323世界气象日",
            "0324世界防治结核病日",
            "0325全国中小学生安全教育日",
            "0330巴勒斯坦国土日",
            "0401愚人节",
            "0407世界卫生日",
            "0422世界地球日",
            "0423世界图书和版权日",
            "0424亚非新闻工作者日",
            "0501国际劳动节",
            "0504五四青年节",
            "0505碘缺乏病防治日",
            "0508世界红十字日",
            "0512国际护士节",
            "0515国际家庭日",
            "0517世界电信日",
            "0518国际博物馆日",
            "0520全国学生营养日",
            "0523国际牛奶日",
            "0531世界无烟日",
            "0601国际儿童节",
            "0605世界环境日",
            "0606全国爱眼日",
            "0617防治荒漠化和干旱日",
            "0623国际奥林匹克日",
            "0625全国土地日",
            "0626国际反毒品日",
            "0701中国GCD建党日 香港回归纪念日 世界建筑日",
            "0702国际体育记者日",
            "0707中国人民抗日战争纪念日",
            "0711世界人口日",
            "0730非洲妇女日",
            "0801八一建军节",
            "0908国际扫盲日",
            "0910中国教师节",
            "0914世界清洁地球日",
            "0916国际和平日 国际臭氧层保护日",
            "0918九·一八事变纪念日",
            "0920作者的生日 国际爱牙日",
            "0927世界旅游日",
            "1001国庆节 国际音乐日 国际老人节",
            "1002国际和平与民主自由斗争日",
            "1004世界动物日",
            "1005世界住房日",
            "1008全国高血压日 世界视觉日",
            "1009世界邮政日",
            "1010辛亥革命纪念日 世界精神卫生日",
            "1013世界保健日 国际教师节",
            "1014世界标准日",
            "1015国际盲人节(白手杖节)",
            "1016世界粮食日",
            "1017世界消除贫困日",
            "1022世界传统医药日",
            "1024联合国日 世界发展信息日",
            "1031世界勤俭日 万圣节前夜",
            "1107十月社会主义革命纪念日",
            "1108中国记者日",
            "1109全国消防安全宣传教育日",
            "1110世界青年节",
            "1114世界糖尿病日",
            "1117国际大学生节 世界学生节",
            "1121世界问候日 世界电视日",
            "1129国际声援巴勒斯坦人民国际日",
            "1201世界爱滋病日",
            "1203世界残疾人日",
            "1205国际经济和社会发展志愿人员日",
            "1208国际儿童电视日",
            "1209纪念一二·九运动 世界足球日",
            "1210世界人权日",
            "1212西安事变纪念日",
            "1213南京大屠杀(1937年)纪念日！紧记血泪史！",
            "1221国际篮球日",
            "1224平安夜",
            "1220澳门回归纪念日",
            "1225圣诞节",
            "1229国际生物多样性日"
        };

        /// <summary>
        /// 获取公历节日
        /// </summary>
        public string nowHoliday()
        {
            Dictionary<string, string> re = new Dictionary<string, string>();
            int month = DateTime.Now.Month;
            int day = DateTime.Now.Day;
            // int daw = DateTime.Now.DayOfWeek
            foreach (string s in holiday)
            {
                if (month == Convert.ToInt32(s.Substring(0, 2)) && day == Convert.ToInt32(s.Substring(2, 2)))
                {
                    return s.Substring(4);
                }
            }
            return null;
        }
    }
}
